`timescale 1ns / 1ps

module top(
    input clk_100M,          // 100MHz时钟
    input rst,               // 复位按键
    input [31:0] SW,         // 物理拨码开关 (保持32位以匹配你的约束文件)
    input [7:0] BT,          // 物理按键 (保持8位以匹配你的约束文件)
    input [1:0] Sel,         // 显示控制 (透传给数码管模块)
    output [7:0] AN,         // 数码管位选
    output [7:0] SEG         // 数码管段选
);

    // 自动售货机核心模块输出的 32位 显示数据
    wire [31:0] vm_disp_data;
    
    // ====================================================
    // 实例化自动售货机模块 (注意位宽截取)
    // ====================================================
    vending_machine vm(
        .clk_100M(clk_100M),
        .rst(rst),
        
        // 关键修改 1: 只截取低 8 位开关传入，符合图片 k[7:0] 要求
        .SW(SW[7:0]),  
        
        // 关键修改 2: 只截取低 4 位按键传入，对应 scortbt, get, sel, finish
        .BT(BT[3:0]),  
        
        .disp_data(vm_disp_data)
    );
    
    // ====================================================
    // 实例化数码管显示模块
    // ====================================================
    Tube_Display tube_display(
        .rst(rst),
        .clk_100M(clk_100M),
        .SW(vm_disp_data),    // 将售货机生成的"格式化数据"送入数码管
        .Sel(Sel),            // 保持原样，透传
        .AN(AN),
        .SEG(SEG)
    );

endmodule